<div class="detail_content markdown-body editormd-preview-container" id="markdown-body">
<div id="app">
<p>原文链接：<a href="https://www.cyberark.com/resources/threat-research-blog/fantastic-rootkits-and-where-to-find-them-part-3-arm-edition" target="_blank">https://www.cyberark.com/resources/threat-research-blog/fantastic-rootkits-and-where-to-find-them-part-3-arm-edition</a></p>
<p><strong>介绍</strong><br/>
在本博客中，我们将讨论非传统架构Windows 11 on ARM64上的创新Rootkit技术。</p>
<p>在之前的帖子中，我们涵盖了应用于现代Windows 10操作系统的Rootkit技术（<a href="https://www.cyberark.com/resources/all-blog-posts/fantastic-rootkits-and-where-to-find-them-part-1" target="_blank" title="第1部分">第1部分</a>）以及用于Intel x86-64的当前威胁的Rootkit分析（<a href="https://www.cyberark.com/resources/all-blog-posts/fantastic-rootkits-and-where-to-find-them-part-1" target="_blank" title="第2部分">第2部分</a>）。</p>
<p>尽管我们尚未遇到任何针对此平台的恶意软件系列，但随着Windows on ARM设备的普及，我们可能会在不久的将来看到它。</p>
<p>在这项研究中，我们想通过将之前在第1部分中讨论的一些Rootkit技术应用于ARM64架构和该架构上Windows平台的内部机制，提前了解潜在对手。</p>
<p>Windows 11 on ARM64是Windows 10 Mobile / RT / CE的继任者，最初设计用于运行在ARM架构上的智能手机和平板电脑。</p>
<p>Windows on ARM（WoA）为智能手机和笔记本电脑等移动设备提供了更好的电池续航时间和出色的性能。运行此架构/平台的设备的一些示例是Microsoft Surface Pro X，Lenovo Thinkpad X13s和Apple Mx（M1 / M2等）设备，这些设备也可以运行Windows on ARM。</p>
<p>ARM处理器基于RISC（精简指令集计算机）架构，这意味着所有指令的字节长度都相同。与CISC（复合指令集计算机）架构（例如英特尔的处理器）相反，每个操作码的字节长度在不同指令之间有所不同。</p>
<p>值得一提的是，WoA平台还模拟了为了向后兼容而针对Intel x86-x64架构编译的用户态应用程序。</p>
<p>最后，在进行这项研究时，我们还编写了一个工具来检测WoA Rootkits。</p>
<p><strong>Windows on ARM64内幕入门</strong><br/>

    <span class="n">PLIST_ENTRY</span> <span class="n">CurrListEntry</span> <span class="o">=</span> <span class="p">(</span><span class="n">PLIST_ENTRY</span><span class="p">)((</span><span class="n">PUCHAR</span><span class="p">)</span><span class="n">CurrentProcess</span> <span class="o">+</span> <span class="n">ActiveOffsetPre</span><span class="p">);</span>
    <span class="n">PLIST_ENTRY</span> <span class="n">PrevListEntry</span> <span class="o">=</span> <span class="n">CurrListEntry</span><span class="o">-&gt;</span><span class="n">Blink</span><span class="p">;</span>
    <span class="n">PLIST_ENTRY</span> <span class="n">NextListEntry</span> <span class="o">=</span> <span class="nb">NULL</span><span class="p">;</span>
    <span class="k">while</span> <span class="p">(</span><span class="n">CurrListEntry</span> <span class="o">!=</span> <span class="n">PrevListEntry</span><span class="p">)</span>
    <span class="p">{</span>
        <span class="n">NextListEntry</span> <span class="o">=</span> <span class="n">CurrListEntry</span><span class="o">-&gt;</span><span class="n">Flink</span><span class="p">;</span>
        <span class="n">currImageFileName</span> <span class="o">=</span> <span class="p">(</span><span class="kt">char</span><span class="o">*</span><span class="p">)(((</span><span class="n">ULONG_PTR</span><span class="p">)</span><span class="n">CurrListEntry</span> <span class="o">-</span> <span class="n">ActiveOffsetPre</span><span class="p">)</span> <span class="o">+</span> <span class="n">ImageName</span><span class="p">);</span>
        <span class="n">DbgPrint</span><span class="p">(</span><span class="s">"Iterating %s</span><span class="se">\r\n</span><span class="s">"</span><span class="p">,</span> <span class="n">currImageFileName</span><span class="p">);</span>
        <span class="k">if</span> <span class="p">(</span><span class="n">strcmp</span><span class="p">(</span><span class="n">currImageFileName</span><span class="p">,</span> <span class="n">ProcessName</span><span class="p">)</span> <span class="o">==</span> <span class="mi">0</span><span class="p">)</span>
        <span class="p">{</span>
            <span class="n">DbgPrint</span><span class="p">(</span><span class="s">"[*] Found Process! Needs To Be Removed %s</span><span class="se">\r\n</span><span class="s">"</span><span class="p">,</span> <span class="n">currImageFileName</span><span class="p">);</span>
            <span class="k">if</span> <span class="p">(</span><span class="n">MmIsAddressValid</span><span class="p">(</span><span class="n">CurrListEntry</span><span class="p">))</span>
            <span class="p">{</span>
                <span class="n">RemoveEntryList</span><span class="p">(</span><span class="n">CurrListEntry</span><span class="p">);</span>
            <span class="p">}</span>
            <span class="k">break</span><span class="p">;</span>
        <span class="p">}</span>
        <span class="n">CurrListEntry</span> <span class="o">=</span> <span class="n">NextListEntry</span><span class="p">;</span>
    <span class="p">}</span>
<span class="p">}</span>
</pre></div>
<p><strong>代码片段13：HideProcess函数片段（DKOM）</strong></p>
<p>这种区别是由于Windows架构版本之间（甚至在同一体系结构的不同Windows版本之间）的EPROCESS结构不同造成的。</p>
<p>让我们看看对此结构所做的相关更改。</p>
<pre><code>0: kd&gt; dt nt!_LIST_ENTRY
+0x000 Flink            : Ptr64 _LIST_ENTRY
+0x008 Blink            : Ptr64 _LIST_ENTRY
0: kd&gt; dt nt!_EPROCESS
+0x000 Pcb              : _KPROCESS
+0x3f0 ProcessLock      : _EX_PUSH_LOCK
+0x3f8 UniqueProcessId  : Ptr64 Void
+0x400 ActiveProcessLinks : _LIST_ENTRY
+0x410 RundownProtect   : _EX_RUNDOWN_REF
+0x418 Flags2           : Uint4B
+0x418 JobNotReallyActive : Pos 0, 1 Bit
+0x418 AccountingFolded : Pos 1, 1 Bit
+0x418 NewProcessReported : Pos 2, 1 Bit
+0x418 ExitProcessReported : Pos 3, 1 Bit
... redacted ...
+0x500 OwnerProcessId   : Uint8B
+0x508 Peb              : Ptr64 _PEB
+0x510 Session          : Ptr64 _MM_SESSION_SPACE
+0x518 Spare1           : Ptr64 Void
+0x520 QuotaBlock       : Ptr64 _EPROCESS_QUOTA_BLOCK
+0x528 ObjectTable      : Ptr64 _HANDLE_TABLE
+0x530 DebugPort        : Ptr64 Void
+0x538 WoW64Process     : Ptr64 _EWOW64PROCESS
+0x540 DeviceMap        : _EX_FAST_REF
+0x548 EtwDataSource    : Ptr64 Void
+0x550 PageDirectoryPte : Uint8B
+0x558 ImageFilePointer : Ptr64 _FILE_OBJECT
+0x560 ImageFileName    : [15] UChar
+0x56f PriorityClass    : UChar
+0x570 SecurityPort     : Ptr64 Void</code></pre>
<p><strong>代码片段14：ARM64中_EPROCESS和_LIST_ENTRY的数据结构</strong></p>
<p>我们注意到ActiveProcessLinks位于EPROCESS结构的偏移量为0x400处，其类型为LIST_ENTRY。此外，ImageFileName位于偏移量为0x560处。</p>
<p>根据EPROCESS和LIST_ENTRY结构，Flink字段位于偏移量为0x400+0x00的位置，即等于0x400。Blink字段位于0x400+0x8的位置，即等于0x408。</p>
<p>我们在代码开头定义这些偏移量：</p>
<div class="highlight"><pre><span></span><span class="n">ULONG_PTR</span> <span class="n">ActiveOffsetPre</span> <span class="o">=</span> <span class="mh">0x400</span><span class="p">;</span>
<span class="n">ULONG_PTR</span> <span class="n">ActiveOffsetNext</span> <span class="o">=</span> <span class="mh">0x408</span><span class="p">;</span>
<span class="n">ULONG_PTR</span> <span class="n">ImageName</span> <span class="o">=</span> <span class="mh">0x560</span><span class="p">;</span>
</pre></div>
<p><strong>代码片段15：全局变量ActiveOffsetPre和ActiveOffsetNext的代码片段</strong></p>
<p><strong>Windows On ARM Rootkit Detector（WOARKD）</strong><br/>
**免责声明2：此工具仍处于开发阶段。</p>
